{
  "month": "February 2026",
  "theme": "The Kingdom Advances",
  "publishedDate": "2026-02-01T00:00:00.000Z",
  "pastoralMessage": {
    "title": "The Kingdom Is Here",
    "content": "Beloved Family,\n\nAs we step into this new month, I want to remind you of a truth that should shape everything we do: the Kingdom of God is not coming — it is here. When Jesus announced, 'The time is fulfilled, and the kingdom of God is at hand' (Mark 1:15), He wasn't pointing to a distant future. He was declaring a present reality.\n\nThis means every area of your life — your work, your family, your community — is territory where King Jesus reigns. You are not just waiting for heaven. You are bringing heaven's rule to earth, right now, right where you are.\n\nThis month, I challenge you to identify one area of your life where you've been living under the old order instead of the Kingdom order. Surrender it to the King. Watch what happens when you let Him reign.\n\nAdvancing with you,\nPastor Curtis Stephens Jr."
  },
  "kingdomIntelligence": [
    {
      "headline": "Underground Church Movement Grows Across Restricted Nations",
      "summary": "Reports from multiple sources indicate unprecedented growth in house church movements across regions where open worship is restricted. Believers are finding creative ways to gather, disciple, and multiply — demonstrating that the Kingdom cannot be contained by human opposition.",
      "source": "Global Mission Reports"
    },
    {
      "headline": "Faith-Based Organizations Lead Community Transformation",
      "summary": "Cities across America are seeing measurable impact from Kingdom-minded organizations tackling homelessness, education gaps, and food insecurity. These initiatives embody the Kingdom principle that the gospel transforms not just individuals, but entire communities.",
      "source": "Community Impact Studies"
    },
    {
      "headline": "Young Leaders Rising in Global Discipleship Networks",
      "summary": "A new generation of Kingdom leaders is emerging through discipleship networks spanning multiple continents. These young men and women are committed to making mature disciples who proclaim Jesus as Lord in every sphere of influence.",
      "source": "Discipleship Network Reports"
    }
  ],
  "kingdomLiving": {
    "title": "Kingdom Authority in Your Workplace",
    "content": "Many believers compartmentalize their faith — Kingdom on Sunday, secular on Monday. But if Jesus is Lord of all, He's Lord of your workplace too.\n\nThis month, practice these Kingdom principles at work:\n\n1. **Excellence as Worship** — Do your work as unto the Lord (Colossians 3:23). Kingdom citizens set the standard.\n2. **Integrity Over Opportunity** — When shortcuts tempt you, remember that Kingdom values don't bend for profit.\n3. **Influence Through Service** — Jesus led by serving. Your greatest influence comes not from your title, but from your willingness to serve others.\n4. **Pray Over Your Domain** — Before you start each day, pray for Kingdom influence in your workplace. You are an ambassador of the King."
  },
  "prayerFocus": [
    "Pray for the persecuted church worldwide — that believers under pressure would stand firm and multiply",
    "Pray for IFM's Kingdom mission — that every member would live as a mature disciple advancing God's reign",
    "Pray for families — that Kingdom order would be established in homes across our community",
    "Pray for our leaders — that God would raise up Kingdom-minded leaders in government, education, and business",
    "Pray for the lost — that the gospel of the Kingdom would break through every barrier and bring people under the lordship of Jesus"
  ],
  "scripture": {
    "verse": "But seek first the kingdom of God and his righteousness, and all these things will be added to you.",
    "reference": "Matthew 6:33 (ESV)",
    "commentary": "Jesus doesn't tell us to seek blessings, comfort, or even ministry success. He tells us to seek the Kingdom first. When the King's rule is our primary pursuit, everything else falls into its proper order. This is the foundational principle of Kingdom living."
  },
  "events": [
    {
      "name": "Monthly In-Person Worship",
      "date": "First Saturday, March 1, 2026 at 12:00 PM",
      "description": "Join us for powerful Kingdom teaching and worship at 24301 Telegraph, Southfield, MI 48033"
    },
    {
      "name": "Daily Kingdom Teaching",
      "date": "Monday - Friday at 8:15 AM",
      "description": "Join Pastor Curtis live on Facebook for daily Kingdom instruction"
    }
  ],
  "featured": true
}
